Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.10.228/edc/ATSAML10D15A.PIC
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_18" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C048" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CRCKEY_2" edc:nzwidth="0x20" edc:desc="CRC Key bits 95:64"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_19" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C04C" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CRCKEY_3" edc:nzwidth="0x20" edc:desc="CRC Key bits 127:96"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:regionid="HSRAM" edc:beginaddr="0x20000000" edc:endaddr="0x20002000" edc:isexecutable="true" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="APBA" edc:beginaddr="0x40000000" edc:endaddr="0x40008000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="APBB" edc:beginaddr="0x41000000" edc:endaddr="0x41010000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="APBC" edc:beginaddr="0x42000000" edc:endaddr="0x42004000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="PPB" edc:beginaddr="0xE0000000" edc:endaddr="0xE000F000" edc:rw="rw">
      <edc:AdjustPoint edc:offset="0x1000" edc:_addr="0xE0000000"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_CTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---nnnnnnnnnnnnn" edc:por="00001011000000000000000000000000" edc:mclr="00001011000000000000000000000000" edc:impl="0xFFFF1FFF" edc:_addr="0xE0001000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CYCCNTENA" edc:nzwidth="0x1" edc:desc="CYCCNT enable"/>
            <edc:SFRFieldDef edc:cname="POSTPRESET" edc:nzwidth="0x4" edc:desc="POSTCNT preset"/>
            <edc:SFRFieldDef edc:cname="POSTINIT" edc:nzwidth="0x4" edc:desc="POSTCNT initial"/>
            <edc:SFRFieldDef edc:cname="CYCTAP" edc:nzwidth="0x1" edc:desc="Cycle count tap"/>
            <edc:SFRFieldDef edc:cname="SYNCTAP" edc:nzwidth="0x2" edc:desc="Synchronization tap"/>
            <edc:SFRFieldDef edc:cname="PCSAMPLENA" edc:nzwidth="0x1" edc:desc="PC sample enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EXCTRCENA" edc:nzwidth="0x1" edc:desc="Exception trace enable"/>
            <edc:SFRFieldDef edc:cname="CPIEVTENA" edc:nzwidth="0x1" edc:desc="CPI event enable"/>
            <edc:SFRFieldDef edc:cname="EXCEVTENA" edc:nzwidth="0x1" edc:desc="Exception event enable"/>
            <edc:SFRFieldDef edc:cname="SLEEPEVTENA" edc:nzwidth="0x1" edc:desc="Sleep event enable"/>
            <edc:SFRFieldDef edc:cname="LSUEVTENA" edc:nzwidth="0x1" edc:desc="LSU event enable"/>
            <edc:SFRFieldDef edc:cname="FOLDEVTENA" edc:nzwidth="0x1" edc:desc="Fold event enable"/>
            <edc:SFRFieldDef edc:cname="CYCEVTENA" edc:nzwidth="0x1" edc:desc="Cycle event enable"/>
            <edc:SFRFieldDef edc:cname="CYCDISS" edc:nzwidth="0x1" edc:desc="Cycle counter disabled secure"/>
            <edc:SFRFieldDef edc:cname="NOPRFCNT" edc:nzwidth="0x1" edc:desc="No profile counters"/>
            <edc:SFRFieldDef edc:cname="NOCYCCNT" edc:nzwidth="0x1" edc:desc="No cycle count"/>
            <edc:SFRFieldDef edc:cname="NOEXTTRIG" edc:nzwidth="0x1" edc:desc="No external triggers"/>
            <edc:SFRFieldDef edc:cname="NOTRCPKT" edc:nzwidth="0x1" edc:desc="No trace packets"/>
            <edc:SFRFieldDef edc:cname="NUMCOMP" edc:nzwidth="0x4" edc:desc="Number of comparators"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0xE0001004"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PCSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000101C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="EIASAMPLE" edc:nzwidth="0x20" edc:desc="Executed instruction address sample"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMPARATOR0DWT_COMP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0001020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="Cycle/PC/data value or data address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0001024"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMPARATOR0DWT_FUNCTION" edc:nzwidth="0x20" edc:access="nnnnn--n------------nn----nnnnnn" edc:impl="0xF9000C3F" edc:_addr="0xE0001028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MATCH" edc:nzwidth="0x4" edc:desc="Match type"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x2" edc:desc="Action on match"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2" edc:desc="Data value size"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1" edc:desc="Comparator matched"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x5" edc:desc="Identify capability"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000102C"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMPARATOR1DWT_COMP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0001030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="Cycle/PC/data value or data address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0001034"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMPARATOR1DWT_FUNCTION" edc:nzwidth="0x20" edc:access="nnnnn--n------------nn----nnnnnn" edc:impl="0xF9000C3F" edc:_addr="0xE0001038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MATCH" edc:nzwidth="0x4" edc:desc="Match type"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x2" edc:desc="Action on match"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2" edc:desc="Data value size"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1" edc:desc="Comparator matched"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x5" edc:desc="Identify capability"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xF74" edc:_addr="0xE000103C"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_LAR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0001FB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x20" edc:desc="Lock access control">
              <edc:SFRFieldSemantic edc:cname="UNLOCK" edc:desc="Unlock key value" edc:when="(field &amp; 0xFFFFFFFF) == 0xC5ACCE55"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_LSR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0xE0001FB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="SLI" edc:nzwidth="0x1" edc:desc="Software Lock implemented"/>
            <edc:SFRFieldDef edc:cname="SLK" edc:nzwidth="0x1" edc:desc="Software Lock status"/>
            <edc:SFRFieldDef edc:cname="nTT" edc:nzwidth="0x1" edc:desc="Not thirty-two bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0001FB8"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_DEVARCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="01000111011100000001101000000010" edc:mclr="01000111011100000001101000000010" edc:_addr="0xE0001FBC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="ARCHPART" edc:nzwidth="0xC" edc:desc="Architecture Part"/>
            <edc:SFRFieldDef edc:cname="ARCHVER" edc:nzwidth="0x4" edc:desc="Architecture Version"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Revision"/>
            <edc:SFRFieldDef edc:cname="PRESENT" edc:nzwidth="0x1" edc:desc="DEVARCH Present"/>
            <edc:SFRFieldDef edc:cname="ARCHITECT" edc:nzwidth="0xB" edc:desc="Architect"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0xE0001FC0"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_DEVTYPE" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0xE0001FCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MAJOR" edc:nzwidth="0x4" edc:desc="Major type"/>
            <edc:SFRFieldDef edc:cname="SUB" edc:nzwidth="0x4" edc:desc="Sub-type"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR4" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE0001FD0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="DES_2" edc:nzwidth="0x4" edc:desc="JEP106 continuation code"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x4" edc:desc="4KB count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0001FD4"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0001FD8"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0001FDC"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE0001FE0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PART_0" edc:nzwidth="0x8" edc:desc="Part number bits[7:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
