Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.10.228/edc/ATSAML10D15A.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40001814"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="VREG" edc:nzwidth="0x20" edc:access="nnnnnnnn----nnnn------nn-nn-nnn-" edc:por="00000000000000000000000000000010" edc:mclr="00000000000000000000000000000010" edc:impl="0xFF0F036E" edc:_addr="0x40001818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="SEL" edc:nzwidth="0x2" edc:desc="Voltage Regulator Selection in active mode">
              <edc:SFRFieldSemantic edc:cname="LDO" edc:desc="LDO selection" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BUCK" edc:desc="Buck selection" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STDBYPL0" edc:nzwidth="0x1" edc:desc="Standby in PL0"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPEFF" edc:nzwidth="0x1" edc:desc="Low Power efficiency"/>
            <edc:SFRFieldDef edc:cname="VREFSEL" edc:nzwidth="0x1" edc:desc="Voltage Regulator Voltage Reference Selection">
              <edc:SFRFieldSemantic edc:cname="SEL_VREF" edc:desc="Selects VREF for the VREG" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SEL_ULPVREF" edc:desc="Selects ULPVREF for the VREG" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="VSVSTEP" edc:nzwidth="0x4" edc:desc="Voltage Scaling Voltage Step"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="VSPER" edc:nzwidth="0x8" edc:desc="Voltage Scaling Period"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="VREF" edc:nzwidth="0x20" edc:access="------------nnnn--------nn---nn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF00C6" edc:_addr="0x4000181C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TSEN" edc:nzwidth="0x1" edc:desc="Temperature Sensor Output Enable"/>
            <edc:SFRFieldDef edc:cname="VREFOE" edc:nzwidth="0x1" edc:desc="Voltage Reference Output Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SEL" edc:nzwidth="0x4" edc:desc="Voltage Reference Selection">
              <edc:SFRFieldSemantic edc:cname="1V0" edc:desc="1.0V voltage reference typical value" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="1V1" edc:desc="1.1V voltage reference typical value" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="1V2" edc:desc="1.2V voltage reference typical value" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="1V25" edc:desc="1.25V voltage reference typical value" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="2V0" edc:desc="2.0V voltage reference typical value" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="2V2" edc:desc="2.2V voltage reference typical value" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="2V4" edc:desc="2.4V voltage reference typical value" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="2V5" edc:desc="2.5V voltage reference typical value" edc:when="(field &amp; 0xF) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40001820"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="EVCTRL" edc:nzwidth="0x20" edc:access="------------------------------n-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x2" edc:_addr="0x4000182C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DETEO" edc:nzwidth="0x1" edc:desc="BOD33 Detection Event Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3D0" edc:_addr="0x40001830"/>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40001C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40001C01"/>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="-------------------------rrrrr-r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7D" edc:_addr="0x40001C04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchroniation Busy bit"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GENCTRL0" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Control 0 Synchronization Busy bit"/>
            <edc:SFRFieldDef edc:cname="GENCTRL1" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Control 1 Synchronization Busy bit"/>
            <edc:SFRFieldDef edc:cname="GENCTRL2" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Control 2 Synchronization Busy bit"/>
            <edc:SFRFieldDef edc:cname="GENCTRL3" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Control 3 Synchronization Busy bit"/>
            <edc:SFRFieldDef edc:cname="GENCTRL4" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Control 4 Synchronization Busy bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
