Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.10.228/edc/ATSAML10D15A.PIC
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40002005">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Early Warning Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40002006">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Early Warning"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x40002007"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="--------------------------rrrrr-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3E" edc:_addr="0x40002008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="WEN" edc:nzwidth="0x1" edc:desc="Window Enable Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run During Standby Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="ALWAYSON" edc:nzwidth="0x1" edc:desc="Always-On Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="CLEAR" edc:nzwidth="0x1" edc:desc="Clear Synchronization Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="CLEAR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x4000200C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:nzwidth="0x8" edc:desc="Watchdog Clear">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Clear Key" edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x401" edc:_addr="0x4000200D"/>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x4000240E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Run During Debug"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x5" edc:_addr="0x4000240F"/>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="FREQCORR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40002414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x7" edc:desc="Correction Value"/>
            <edc:SFRFieldDef edc:cname="SIGN" edc:nzwidth="0x1" edc:desc="Correction Sign"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2B" edc:_addr="0x40002415"/>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="GP0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40002440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="GP" edc:nzwidth="0x20" edc:desc="General Purpose"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="GP1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40002444">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="GP" edc:nzwidth="0x20" edc:desc="General Purpose"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x40002448"/>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="TAMPCTRL" edc:nzwidth="0x20" edc:access="----nn-n----nn-n--------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xD0D00FF" edc:_addr="0x40002460">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="IN0ACT" edc:nzwidth="0x2" edc:desc="Tamper Input 0 Action">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake without timestamp" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN0 to OUT" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IN1ACT" edc:nzwidth="0x2" edc:desc="Tamper Input 1 Action">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake without timestamp" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN1 to OUT" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IN2ACT" edc:nzwidth="0x2" edc:desc="Tamper Input 2 Action">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake without timestamp" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN2 to OUT" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IN3ACT" edc:nzwidth="0x2" edc:desc="Tamper Input 3 Action">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake without timestamp" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN3 to OUT" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="TAMLVL0" edc:nzwidth="0x1" edc:desc="Tamper Level Select 0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMLVL2" edc:nzwidth="0x1" edc:desc="Tamper Level Select 2"/>
            <edc:SFRFieldDef edc:cname="TAMLVL3" edc:nzwidth="0x1" edc:desc="Tamper Level Select 3"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DEBNC0" edc:nzwidth="0x1" edc:desc="Debouncer Enable 0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBNC2" edc:nzwidth="0x1" edc:desc="Debouncer Enable 2"/>
            <edc:SFRFieldDef edc:cname="DEBNC3" edc:nzwidth="0x1" edc:desc="Debouncer Enable 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40002464"/>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="TAMPID" edc:nzwidth="0x20" edc:access="n---------------------------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x8000000F" edc:_addr="0x40002468">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="TAMPID0" edc:nzwidth="0x1" edc:desc="Tamper Input 0 Detected"/>
            <edc:SFRFieldDef edc:cname="TAMPID1" edc:nzwidth="0x1" edc:desc="Tamper Input 1 Detected"/>
            <edc:SFRFieldDef edc:cname="TAMPID2" edc:nzwidth="0x1" edc:desc="Tamper Input 2 Detected"/>
            <edc:SFRFieldDef edc:cname="TAMPID3" edc:nzwidth="0x1" edc:desc="Tamper Input 3 Detected"/>
            <edc:AdjustPoint edc:offset="0x1B"/>
            <edc:SFRFieldDef edc:cname="TAMPEVT" edc:nzwidth="0x1" edc:desc="Tamper Event Detected"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="TAMPCTRLB" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF" edc:_addr="0x4000246C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ALSI0" edc:nzwidth="0x1" edc:desc="Active Layer Select Internal 0"/>
            <edc:SFRFieldDef edc:cname="ALSI1" edc:nzwidth="0x1" edc:desc="Active Layer Select Internal 1"/>
            <edc:SFRFieldDef edc:cname="ALSI2" edc:nzwidth="0x1" edc:desc="Active Layer Select Internal 2"/>
            <edc:SFRFieldDef edc:cname="ALSI3" edc:nzwidth="0x1" edc:desc="Active Layer Select Internal 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x390" edc:_addr="0x40002470"/>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="---n--nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x13" edc:_addr="0x40002800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CKSEL" edc:nzwidth="0x1" edc:desc="Clock Selection">
              <edc:SFRFieldSemantic edc:cname="CLK_GCLK" edc:desc="Clocked by GCLK" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLK_ULP32K" edc:desc="Clocked by ULP32K" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="NMICTRL" edc:nzwidth="0x8" edc:access="---nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1F" edc:_addr="0x40002801">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="NMISENSE" edc:nzwidth="0x3" edc:desc="Non-Maskable Interrupt Sense Configuration">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising-edge detection" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling-edge detection" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both-edges detection" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High-level detection" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low-level detection" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NMIFILTEN" edc:nzwidth="0x1" edc:desc="Non-Maskable Interrupt Filter Enable"/>
            <edc:SFRFieldDef edc:cname="NMIASYNCH" edc:nzwidth="0x1" edc:desc="Asynchronous Edge Detection Mode">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
