Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.10.228/edc/ATSAML10D15A.PIC
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="NSCHK" edc:nzwidth="0x20" edc:access="n-----------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x800000FF" edc:_addr="0x4000283C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT" edc:nzwidth="0x8" edc:desc="External Interrupt Nonsecure Check Enable"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:nzwidth="0x1" edc:desc="Non-Maskable External Interrupt Nonsecure Check Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="NONSEC" edc:nzwidth="0x20" edc:access="n-----------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x800000FF" edc:_addr="0x40002840">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT" edc:nzwidth="0x8" edc:desc="External Interrupt Nonsecure Enable"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:nzwidth="0x1" edc:desc="Non-Maskable Interrupt Nonsecure Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3BC" edc:_addr="0x40002844"/>
      <edc:SFRDef ltx:memberofperipheral="FREQM" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40002C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FREQM" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="-------w" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40002C01">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Start Measurement"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FREQM" edc:cname="CFGA" edc:nzwidth="0x10" edc:access="n-------nnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x80FF" edc:_addr="0x40002C02">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="REFNUM" edc:nzwidth="0x8" edc:desc="Number of Reference Clock Cycles"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DIVREF" edc:nzwidth="0x1" edc:desc="Divide Reference Clock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40002C04"/>
      <edc:SFRDef ltx:memberofperipheral="FREQM" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40002C08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Measurement Done Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FREQM" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40002C09">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Measurement Done Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FREQM" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40002C0A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Measurement Done"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FREQM" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40002C0B">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="FREQM Status"/>
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Sticky Count Value Overflow"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FREQM" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x40002C0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FREQM" edc:cname="VALUE" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x40002C10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x18" edc:desc="Measurement Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
