Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.10.228/edc/ATSAML10D15A.PIC
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="STATUSB" edc:nzwidth="0x8" edc:access="rrrrrrrr" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x41002002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DAL" edc:nzwidth="0x2" edc:desc="Debugger Access Level">
              <edc:SFRFieldSemantic edc:cname="SECURED" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FULL_DEBUG" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DBGPRES" edc:nzwidth="0x1" edc:desc="Debugger Present"/>
            <edc:SFRFieldDef edc:cname="HPE" edc:nzwidth="0x1" edc:desc="Hot-Plugging Enable"/>
            <edc:SFRFieldDef edc:cname="DCCD0" edc:nzwidth="0x1" edc:desc="Debug Communication Channel 0 Dirty"/>
            <edc:SFRFieldDef edc:cname="DCCD1" edc:nzwidth="0x1" edc:desc="Debug Communication Channel 1 Dirty"/>
            <edc:SFRFieldDef edc:cname="BCCD0" edc:nzwidth="0x1" edc:desc="Boot ROM Communication Channel 0 Dirty"/>
            <edc:SFRFieldDef edc:cname="BCCD1" edc:nzwidth="0x1" edc:desc="Boot ROM Communication Channel 1 Dirty"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x41002003"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="ADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="AMOD" edc:nzwidth="0x2" edc:desc="Access Mode"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1E" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="LENGTH" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFC" edc:_addr="0x41002008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:nzwidth="0x1E" edc:desc="Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DATA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100200C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DCC0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DCC1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DID" edc:nzwidth="0x20" edc:access="rrrrrrrrr-rrrrrrrrrrrrrrrrrrrrrr" edc:por="00100000100001000000000000000100" edc:mclr="00100000100001000000000000000100" edc:impl="0xFFBFFFFF" edc:_addr="0x41002018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:nzwidth="0x8" edc:desc="Device Select"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Revision Number"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:nzwidth="0x4" edc:desc="Die Number"/>
            <edc:SFRFieldDef edc:cname="SERIES" edc:nzwidth="0x6" edc:desc="Series">
              <edc:SFRFieldSemantic edc:cname="SAM_L11" edc:desc="SAM L11" edc:when="(field &amp; 0x3F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SAM_L10" edc:desc="SAM L10" edc:when="(field &amp; 0x3F) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FAMILY" edc:nzwidth="0x5" edc:desc="Family">
              <edc:SFRFieldSemantic edc:cname="SAML" edc:desc="Ultra Low Power Microcontroller" edc:when="(field &amp; 0x1F) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PROCESSOR" edc:nzwidth="0x4" edc:desc="Processor">
              <edc:SFRFieldSemantic edc:cname="CM0P" edc:desc="Cortex-M0+" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CM23" edc:desc="Cortex-M23" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CM3" edc:desc="Cortex-M3" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CM4" edc:desc="Cortex-M4" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CM4F" edc:desc="Cortex-M4 with FPU" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="CM33" edc:desc="Cortex-M33" edc:when="(field &amp; 0xF) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CFG" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:por="00000000000000000000000000000010" edc:mclr="00000000000000000000000000000010" edc:impl="0xF" edc:_addr="0x4100201C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="LQOS" edc:nzwidth="0x2" edc:desc="Latency Quality Of Service"/>
            <edc:SFRFieldDef edc:cname="DCCDMALEVEL" edc:nzwidth="0x2" edc:desc="DMA Trigger Level">
              <edc:SFRFieldSemantic edc:cname="EMPTY" edc:desc="Trigger rises when DCC is empty" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="Trigger rises when DCC is full" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
