Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.10.228/edc/ATSAML10D15A.PIC
      <edc:AdjustPoint edc:offset="0x84" edc:_addr="0x41004048"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="MEMTYPE" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x410040CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SMEMP" edc:nzwidth="0x1" edc:desc="System Memory Present"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID4" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x410040D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPCC" edc:nzwidth="0x4" edc:desc="JEP-106 Continuation Code"/>
            <edc:SFRFieldDef edc:cname="FKBC" edc:nzwidth="0x4" edc:desc="4KB count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410040D4"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410040D8"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410040DC"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000011010000" edc:mclr="00000000000000000000000011010000" edc:impl="0xFF" edc:_addr="0x410040E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBL" edc:nzwidth="0x8" edc:desc="Part Number Low"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID1" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000011111100" edc:mclr="00000000000000000000000011111100" edc:impl="0xFF" edc:_addr="0x410040E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBH" edc:nzwidth="0x4" edc:desc="Part Number High"/>
            <edc:SFRFieldDef edc:cname="JEPIDCL" edc:nzwidth="0x4" edc:desc="Low part of the JEP-106 Identity Code"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID2" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000001001" edc:mclr="00000000000000000000000000001001" edc:impl="0xFF" edc:_addr="0x410040E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPIDCH" edc:nzwidth="0x3" edc:desc="JEP-106 Identity Code High"/>
            <edc:SFRFieldDef edc:cname="JEPU" edc:nzwidth="0x1" edc:desc="JEP-106 Identity Code is used"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Revision Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="PID3" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x410040EC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="CUSMOD" edc:nzwidth="0x4" edc:desc="ARM CUSMOD"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:nzwidth="0x4" edc:desc="Revision Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CID0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000001101" edc:mclr="00000000000000000000000000001101" edc:impl="0xFF" edc:_addr="0x410040F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB0" edc:nzwidth="0x8" edc:desc="Preamble Byte 0"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CID1" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000010000" edc:mclr="00000000000000000000000000010000" edc:impl="0xFF" edc:_addr="0x410040F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLE" edc:nzwidth="0x4" edc:desc="Preamble"/>
            <edc:SFRFieldDef edc:cname="CCLASS" edc:nzwidth="0x4" edc:desc="Component Class"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CID2" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000101" edc:mclr="00000000000000000000000000000101" edc:impl="0xFF" edc:_addr="0x410040F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB2" edc:nzwidth="0x8" edc:desc="Preamble Byte 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CID3" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000010110001" edc:mclr="00000000000000000000000010110001" edc:impl="0xFF" edc:_addr="0x410040FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB3" edc:nzwidth="0x8" edc:desc="Preamble Byte 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1F00" edc:_addr="0x41004100"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CTRL" edc:nzwidth="0x10" edc:access="----nnnn-----nnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF07" edc:_addr="0x41006000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="DMAENABLE" edc:nzwidth="0x1" edc:desc="DMA Enable"/>
            <edc:SFRFieldDef edc:cname="CRCENABLE" edc:nzwidth="0x1" edc:desc="CRC Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LVLEN0" edc:nzwidth="0x1" edc:desc="Priority Level 0 Enable"/>
            <edc:SFRFieldDef edc:cname="LVLEN1" edc:nzwidth="0x1" edc:desc="Priority Level 1 Enable"/>
            <edc:SFRFieldDef edc:cname="LVLEN2" edc:nzwidth="0x1" edc:desc="Priority Level 2 Enable"/>
            <edc:SFRFieldDef edc:cname="LVLEN3" edc:nzwidth="0x1" edc:desc="Priority Level 3 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCCTRL" edc:nzwidth="0x10" edc:access="--nnnnnn----nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3F0F" edc:_addr="0x41006002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCBEATSIZE" edc:nzwidth="0x2" edc:desc="CRC Beat Size">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="8-bit bus transfer" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HWORD" edc:desc="16-bit bus transfer" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="32-bit bus transfer" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CRCPOLY" edc:nzwidth="0x2" edc:desc="CRC Polynomial Type">
              <edc:SFRFieldSemantic edc:cname="CRC16" edc:desc="CRC-16 (CRC-CCITT)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CRC32" edc:desc="CRC32 (IEEE 802.3)" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CRCSRC" edc:nzwidth="0x6" edc:desc="CRC Input Source">
              <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No action" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O interface" edc:when="(field &amp; 0x3F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CHN0" edc:desc="DMA Channel 0" edc:when="(field &amp; 0x3F) == 0x20"/>
              <edc:SFRFieldSemantic edc:cname="CHN1" edc:desc="DMA Channel 1" edc:when="(field &amp; 0x3F) == 0x21"/>
              <edc:SFRFieldSemantic edc:cname="CHN2" edc:desc="DMA Channel 2" edc:when="(field &amp; 0x3F) == 0x22"/>
              <edc:SFRFieldSemantic edc:cname="CHN3" edc:desc="DMA Channel 3" edc:when="(field &amp; 0x3F) == 0x23"/>
              <edc:SFRFieldSemantic edc:cname="CHN4" edc:desc="DMA Channel 4" edc:when="(field &amp; 0x3F) == 0x24"/>
              <edc:SFRFieldSemantic edc:cname="CHN5" edc:desc="DMA Channel 5" edc:when="(field &amp; 0x3F) == 0x25"/>
              <edc:SFRFieldSemantic edc:cname="CHN6" edc:desc="DMA Channel 6" edc:when="(field &amp; 0x3F) == 0x26"/>
              <edc:SFRFieldSemantic edc:cname="CHN7" edc:desc="DMA Channel 7" edc:when="(field &amp; 0x3F) == 0x27"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
